In [2]:
import numpy as np
import pandas as pd

# Pandas Dataframes

In [ ]:
# Creating Dataframe type1 dict+list
d1 = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'London', 'Paris']
}

In [3]:
pdf1 = pd.DataFrame(d1)

In [4]:
pdf1

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris